Revit 2026 API

# ThemeChangedEventArgs Properties

---

The ThemeChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | ThemeChangedType | Get the application frame theme Type. |

#### Reference

ThemeChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace